<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class SeoItemsTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('seo_items')->delete();
        
        \DB::table('seo_items')->insert(array (
            0 => 
            array (
                'id' => 1,
                'slug' => 'گوشی-موبایل-اپل-مدل-iphone-13-ch-دو-سیم-کارت-ظرفیت-128-گیگابایت-و-رم-4-گیگابایت-نات-اکتیو',
                'meta_title' => 'قیمت و خرید گوشی موبایل اپل مدل iPhone 13 CH دو سیم‌ کارت ظرفیت 128 گیگابایت و رم 4 گیگابایت - نات اکتیو',
                'meta_description' => 'خرید اینترنتی گوشی موبایل اپل مدل iPhone 13 CH دو سیم‌ کارت ظرفیت 128 گیگابایت و رم 4 گیگابایت - نات اکتیو با رنگبندی سفید، مشکی، آبی، صورتی به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'type' => 'product',
                'ref_id' => 1,
                'created_at' => '2024-06-20 09:38:36',
                'updated_at' => '2024-06-20 09:38:36',
            ),
            1 => 
            array (
                'id' => 2,
                'slug' => 'گوشی موبایل سامسونگ مدل Galaxy S24 Ultra دو سیم کارت ظرفیت 256 گیگابایت و رم 12 گیگابایت - ویتنام',
                'meta_title' => 'قیمت و خرید گوشی موبایل سامسونگ مدل Galaxy S24 Ultra دو سیم کارت ظرفیت 256 گیگابایت و رم 12 گیگابایت - ویتنام',
                'meta_description' => 'خرید اینترنتی گوشی موبایل سامسونگ مدل Galaxy S24 Ultra دو سیم کارت ظرفیت 256 گیگابایت و رم 12 گیگابایت - ویتنام با رنگبندی خاکستری، مشکی، زرد، بنفش به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'type' => 'product',
                'ref_id' => 2,
                'created_at' => '2024-06-20 09:48:15',
                'updated_at' => '2024-06-20 09:48:15',
            ),
            2 => 
            array (
                'id' => 3,
                'slug' => 'لپ-تاپ-134-اینچی-ایسوس-مدل-rog-flow-z13-gz301ze-i9-12900h-16gb-1ssd-rtx3050ti',
                'meta_title' => 'قیمت و خرید لپ تاپ 13.4 اینچی ایسوس مدل ROG Flow Z13 GZ301ZE-i9 12900H 16GB 1SSD RTX3050Ti',
                'meta_description' => 'خرید اینترنتی لپ تاپ 13.4 اینچی ایسوس مدل ROG Flow Z13 GZ301ZE-i9 12900H 16GB 1SSD RTX3050Ti با رنگبندی مشکی به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'type' => 'product',
                'ref_id' => 3,
                'created_at' => '2024-06-20 09:58:03',
                'updated_at' => '2024-06-20 09:58:03',
            ),
            3 => 
            array (
                'id' => 4,
                'slug' => 'لپ-تاپ-156-اینچی-ایسوس-مدل-tuf-gaming-f15-fx506he-hn393w-i7-11800h-16gb-512ssd-rtx3050ti-w',
                'meta_title' => 'قیمت و خرید لپ تاپ 15.6 اینچی ایسوس مدل TUF Gaming F15 FX506HE-HN393W-i7 11800H 16GB 512SSD RTX3050TI W',
                'meta_description' => 'خرید اینترنتی لپ تاپ 15.6 اینچی ایسوس مدل TUF Gaming F15 FX506HE-HN393W-i7 11800H 16GB 512SSD RTX3050TI W با رنگبندی مشکی به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'type' => 'product',
                'ref_id' => 4,
                'created_at' => '2024-06-20 10:00:25',
                'updated_at' => '2024-06-20 10:00:25',
            ),
            4 => 
            array (
                'id' => 5,
                'slug' => 'هدفون-بلوتوثی-سونی-مدل-wf-1000xm5',
                'meta_title' => 'قیمت و خرید هدفون بلوتوثی سونی مدل WF-1000XM5',
                'meta_description' => 'خرید اینترنتی هدفون بلوتوثی سونی مدل WF-1000XM5 با رنگبندی مشکی، سفید، نقره ای به همراه مقایسه، بررسی مشخصات و لیست قیمت امروز در فروشگاه اینترنتی دیجی‌کالا
',
                'type' => 'product',
                'ref_id' => 5,
                'created_at' => '2024-06-20 10:05:16',
                'updated_at' => '2024-06-20 10:05:16',
            ),
            5 => 
            array (
                'id' => 6,
                'slug' => '31232',
                'meta_title' => '',
                'meta_description' => '',
                'type' => 'product',
                'ref_id' => 6,
                'created_at' => '2024-06-20 10:19:01',
                'updated_at' => '2024-06-20 10:19:01',
            ),
        ));
        
        
    }
}